In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Zillow ZRI

In [2]:
main_dataframe = pd.read_csv('../../data/zillow/Zip_Zri_MultiFamilyResidenceRental.csv', dtype = {'RegionName':str})
main_dataframe.rename(columns = {'RegionName':'Zipcode'}, inplace = True)
main_dataframe['Zipcode'] = main_dataframe['Zipcode'].str.zfill(5)

In [3]:
main_dataframe = pd.melt(main_dataframe, id_vars =main_dataframe.columns[:7],
                         value_vars = main_dataframe.columns[7:],
                         var_name = 'Date', 
                         value_name = 'Rent')
main_dataframe['Date'] = pd.to_datetime(main_dataframe['Date'])

In [4]:
fill_rents = main_dataframe[['Zipcode', 'Rent', 'Date']].copy()
# zori_sf_metro.drop('Rent', axis = 1, inplace = True)

fill_rents = fill_rents.reset_index().pivot(index = 'Date',columns = 'Zipcode')['Rent'].reset_index()
for code in fill_rents.columns[1:]:
     fill_rents[code].interpolate(inplace = True)
fill_rents.fillna(method = 'bfill',inplace = True)
fill_rents = pd.melt(fill_rents, id_vars='Date', 
                                  value_vars = fill_rents.columns[1:],
                                  var_name='Zipcode',value_name = 'Rent')

main_dataframe.drop('Rent', axis = 1, inplace = True)
main_dataframe = pd.merge(main_dataframe, fill_rents, on = ['Date','Zipcode'])

In [5]:
main_dataframe.isnull().sum()

RegionID        0
Zipcode         0
City            0
State           0
Metro         339
CountyName      0
SizeRank        0
Date            0
Rent            0
dtype: int64

In [6]:
main_dataframe['Year'] = main_dataframe['Date'].dt.year
main_dataframe

,RegionID,Zipcode,City,State,Metro,CountyName,SizeRank,Date,Rent,Year
0,61639,10025,New York,NY,New York-Newark-Jersey City,New York County,1,2010-09-01,2930.0,2010
1,84654,60657,Chicago,IL,Chicago-Naperville-Elgin,Cook County,2,2010-09-01,1447.0,2010
2,61637,10023,New York,NY,New York-Newark-Jersey City,New York County,3,2010-09-01,2797.0,2010
3,91982,77494,Katy,TX,Houston-The Woodlands-Sugar Land,Harris County,4,2010-09-01,1081.0,2010
4,84616,60614,Chicago,IL,Chicago-Naperville-Elgin,Cook County,5,2010-09-01,1437.0,2010
...,...,...,...,...,...,...,...,...,...,...
210288,90755,75202,Dallas,TX,Dallas-Fort Worth-Arlington,Dallas County,1857,2020-01-01,1739.0,2020
210289,94610,84627,Ephraim,UT,NaN,Sanpete County,1858,2020-01-01,1298.0,2020
210290,84452,60301,Oak Park,IL,Chicago-Naperville-Elgin,Cook County,1859,2020-01-01,1625.0,2020
210291,94629,84647,Mount Pleasant,UT,NaN,Sanpete County,1860,2020-01-01,1221.0,2020
210292,91695,77046,Houston,TX,Houston-The Woodlands-Sugar Land,Harris County,1861,2020-01-01,1398.0,2020

## Air Quality

In [7]:
fpath = '../../data/airqual/'
cols = ['Date Local','Arithmetic Mean','State Name', 'County Name', 'City Name']
file_list = [(f'{fpath}/daily_42602_{year}.csv') for year in range(2010, 2021)]
dataframe = pd.read_csv(file_list[0], usecols = cols)

In [8]:
file_list = [(f'{fpath}/daily_42602_{year}.csv') for year in range(2010, 2021)]
cols = ['Date Local', 'Arithmetic Mean', 'State Name', 'County Name', 'City Name']

dataframe = pd.read_csv(file_list[0], usecols = cols)

for file in file_list[1:]:
    new_df = pd.read_csv(file, usecols = cols)
    dataframe = pd.concat([dataframe, new_df], axis=0)

In [9]:
dataframe['Date Local'] = pd.to_datetime(dataframe['Date Local'])
dataframe['Month'] = dataframe['Date Local'].dt.month
dataframe['Year'] = dataframe['Date Local'].dt.year
dataframe = dataframe.groupby(['State Name', 'County Name', 'City Name', 'Year', 'Month'])[['Arithmetic Mean']].agg('mean').reset_index()
dataframe.Month = dataframe.Month.astype(str)
dataframe.Month = dataframe.Month.str.zfill(2)
dataframe['Date'] = '01/'+dataframe.Month.astype(str)+'/'+dataframe.Year.astype(str)
dataframe['Date'] = pd.to_datetime(dataframe['Date'], format="%d/%m/%Y")
dataframe.drop(['Month', 'Year'],axis=1,inplace=True)

dataframe.rename(columns={'State Name': 'State', 
                            'County Name': 'County', 
                            'City Name':'City',
                            'Arithmetic Mean':'AQI_mean_ppb'}, inplace=True)

In [10]:
dataframe['Date'] = pd.to_datetime(dataframe['Date'], format="%d/%m/%Y")

In [11]:
dataframe

         State     County        City  AQI_mean_ppb       Date
0      Alabama  Jefferson  Birmingham     12.065635 2013-12-01
1      Alabama  Jefferson  Birmingham     12.899658 2014-01-01
2      Alabama  Jefferson  Birmingham      8.851034 2014-02-01
3      Alabama  Jefferson  Birmingham     13.212881 2014-03-01
4      Alabama  Jefferson  Birmingham     11.379411 2014-04-01
...        ...        ...         ...           ...        ...
42884  Wyoming     Weston   Newcastle      2.548553 2016-06-01
42885  Wyoming     Weston   Newcastle      2.558559 2016-07-01
42886  Wyoming     Weston   Newcastle      1.258537 2016-08-01
42887  Wyoming     Weston   Newcastle      0.539661 2016-09-01
42888  Wyoming     Weston   Newcastle      1.694495 2016-10-01

[42889 rows x 5 columns]

## Personal Income

In [12]:
path = '../../data/real_personal_income.csv'
dataframe = pd.read_csv(path)
dataframe = dataframe[dataframe.LineCode == 2]
dataframe.drop(['GeoFips','LineCode'],axis=1,inplace=True)

dataframe = dataframe.melt(id_vars = ['MetroArea','Description'],
                            var_name='Year', 
                            value_name='Personal Income').\
                            drop('Description',axis=1)

dataframe['Year'] = pd.to_datetime(dataframe['Year']).dt.year

dataframe.rename(columns={'MetroArea':'City'}, inplace=True)

In [13]:
dataframe

             City  Year  Personal Income
0          Austin  2008            44521
1           Miami  2008            44447
2        New York  2008            48585
3   San Francisco  2008            54862
4          Austin  2009            42103
5           Miami  2009            40469
6        New York  2009            46606
7   San Francisco  2009            52251
8          Austin  2010            43390
9           Miami  2010            42729
10       New York  2010            46919
11  San Francisco  2010            53066
12         Austin  2011            45502
13          Miami  2011            43331
14       New York  2011            48043
15  San Francisco  2011            55687
16         Austin  2012            47630
17          Miami  2012            43929
18       New York  2012            49407
19  San Francisco  2012            58278
20         Austin  2013            47438
21          Miami  2013            42196
22       New York  2013            49511
23  San Francisco  2013            57850
24         Austin  2014            49312
25          Miami  2014            44158
26       New York  2014            51102
27  San Francisco  2014            60262
28         Austin  2015            50350
29          Miami  2015            46263
30       New York  2015            52904
31  San Francisco  2015            64192
32         Austin  2016            50896
33          Miami  2016            45682
34       New York  2016            53694
35  San Francisco  2016            65860
36         Austin  2017            53815
37          Miami  2017            47723
38       New York  2017            55716
39  San Francisco  2017            67287
40         Austin  2018            55946
41          Miami  2018            49634
42       New York  2018            56922
43  San Francisco  2018            69759
44         Austin  2019            57297
45          Miami  2019            50120
46       New York  2019            58355
47  San Francisco  2019            71668

##  Income Level CRC

In [14]:
dataframe = pd.read_csv('../../data/volume_data_Income_Level_CRC.csv')

In [15]:
dataframe

     month     date           vol     vol_unadj income_level_group
0       60  2005-01  1.461366e+10  1.287236e+10               High
1       60  2005-01  1.527169e+10  1.342024e+10             Middle
2       60  2005-01  4.578106e+09  3.978007e+09           Moderate
3       60  2005-01  7.635135e+08  6.517910e+08                Low
4       61  2005-02  1.433436e+10  1.272458e+10               High
..     ...      ...           ...           ...                ...
647    221  2018-06  8.982546e+08  9.167395e+08                Low
648    222  2018-07  1.279173e+10  1.364601e+10             Middle
649    222  2018-07  1.368489e+10  1.400351e+10               High
650    222  2018-07  4.220966e+09  4.625639e+09           Moderate
651    222  2018-07  8.639582e+08  9.420156e+08                Low

[652 rows x 5 columns]

In [16]:
dataframe.drop('month', axis=1, inplace=True)
dataframe = dataframe[(dataframe['income_level_group'] != "High") & 
                        (dataframe['income_level_group'] != "Middle")]

dataframe.rename(columns={'date':'Date'}, inplace=True)

dataframe['Date'] = pd.to_datetime(dataframe['Date']+'-01', format="%Y-%m-%d")

dataframe

/Users/pizac/Applications/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:4133: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,
/Users/pizac/Applications/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys

          Date           vol     vol_unadj income_level_group
2   2005-01-01  4.578106e+09  3.978007e+09           Moderate
3   2005-01-01  7.635135e+08  6.517910e+08                Low
6   2005-02-01  4.563908e+09  3.900504e+09           Moderate
7   2005-02-01  7.558710e+08  6.549358e+08                Low
10  2005-03-01  4.762458e+09  4.775794e+09           Moderate
..         ...           ...           ...                ...
643 2018-05-01  8.904970e+08  9.429447e+08                Low
646 2018-06-01  4.398129e+09  4.513570e+09           Moderate
647 2018-06-01  8.982546e+08  9.167395e+08                Low
650 2018-07-01  4.220966e+09  4.625639e+09           Moderate
651 2018-07-01  8.639582e+08  9.420156e+08                Low

[326 rows x 4 columns]

## Census

In [17]:
dataframe = pd.read_csv('../../data/census-query.csv',dtype={'zip_code':str})
dataframe

,geo_id,do_date,total_pop,households,male_pop,female_pop,median_age,male_under_5,male_5_to_9,male_10_to_14,...,sales_office_employed,in_grades_1_to_4,in_grades_5_to_8,in_grades_9_to_12,in_school,in_undergrad_college,speak_only_english_at_home,speak_spanish_at_home,speak_spanish_at_home_low_english,zip_code
0,87537,2014-01-01,2510,856,1283,1227,42.1,58,75,87,...,NaN,304,171,80,593,20,NaN,NaN,NaN,87537
1,87017,2014-01-01,346,112,150,196,50.9,0,0,12,...,NaN,0,27,15,96,40,NaN,NaN,NaN,87017
2,87528,2014-01-01,3505,727,1758,1747,27.9,260,194,159,...,NaN,293,266,298,1237,138,NaN,NaN,NaN,87528
3,87533,2014-01-01,133,58,49,84,25.8,0,12,8,...,NaN,24,8,7,58,3,NaN,NaN,NaN,87533
4,87511,2014-01-01,2896,787,1177,1719,36.0,142,63,44,...,NaN,263,107,163,1008,279,NaN,NaN,NaN,87511
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
33084,35463,2014-01-01,1794,704,904,890,42.6,84,46,58,...,217.0,134,50,113,389,50,NaN,NaN,NaN,35463
33085,77664,2014-01-01,2667,934,1300,1367,45.6,29,54,113,...,212.0,38,286,125,647,171,NaN,NaN,NaN,77664
33086,21822,2014-01-01,2013,776,1070,943,36.8,34,59,88,...,106.0,83,198,40,645,240,NaN,NaN,NaN,21822
33087,7418,2014-01-01,2304,766,1281,1023,40.8,56,27,93,...,336.0,81,93,292,711,136,NaN,NaN,NaN,07418
33088,3036,2014-01-01,5039,1683,2573,2466,42.8,94,223,207,...,656.0,327,291,202,1298,155,NaN,NaN,NaN,03036

# Transformer Function Testing

In [18]:
from transformers import *

zillow_path = '../../data/zillow/Zip_Zri_MultiFamilyResidenceRental.csv'
airqual_path = '../../data/airqual/' #path to folder
persinc_path = '../../data/real_personal_income.csv'
inclvl_path = '../../data/volume_data_Income_Level_CRC.csv'
census_path = '../../data/census-query.csv'

zillow_data = transform_zillow(zillow_path)
airqual_data = transform_air_qual(airqual_path)
persinc_data = transform_pers_income(persinc_path)
inclvl_data = transform_income_level(inclvl_path)
census_data = transform_census(census_path)

In [19]:
zillow_data.head()

,RegionID,Zipcode,City,State,Metro,County,SizeRank,Date,Rent,Year
96772,61639,10025,New York,NY,New York-Newark-Jersey City,New York County,1,2015-01-01,3566.0,2015
96773,84654,60657,Chicago,IL,Chicago-Naperville-Elgin,Cook County,2,2015-01-01,1672.0,2015
96774,61637,10023,New York,NY,New York-Newark-Jersey City,New York County,3,2015-01-01,3413.0,2015
96775,91982,77494,Katy,TX,Houston-The Woodlands-Sugar Land,Harris County,4,2015-01-01,1137.0,2015
96776,84616,60614,Chicago,IL,Chicago-Naperville-Elgin,Cook County,5,2015-01-01,1822.0,2015

In [20]:
airqual_data.head()

     State     County        City    AQIMean       Date
0  Alabama  Jefferson  Birmingham  12.065635 2013-12-01
1  Alabama  Jefferson  Birmingham  12.899658 2014-01-01
2  Alabama  Jefferson  Birmingham   8.851034 2014-02-01
3  Alabama  Jefferson  Birmingham  13.212881 2014-03-01
4  Alabama  Jefferson  Birmingham  11.379411 2014-04-01

In [21]:
persinc_data.head()

  State  Year  PersonalIncome
0    TX  2008           44521
1    FL  2008           44447
2    NY  2008           48585
3    CA  2008           54862
4    TX  2009           42103

In [ ]:
inclvl_data.head()

In [ ]:
census_data.head()

## merging data to one master csv

In [23]:
rent_data = zillow_data.merge(persinc_data,left_on = ['State','Year'],
                             right_on = ['State','Year'])

In [24]:
airqual_data['County'] = airqual_data['County'].apply(lambda County: County + ' County')
airqual_data.drop('State',axis = 1, inplace = True)
rent_data = rent_data.merge(airqual_data,on = ['County','Date','City'],how = 'left')
rent_data.head()

,RegionID,Zipcode,City,State,Metro,County,SizeRank,Date,Rent,Year,PersonalIncome,AQIMean
0,61639,10025,New York,NY,New York-Newark-Jersey City,New York County,1,2015-01-01,3566.0,2015,52904,NaN
1,61637,10023,New York,NY,New York-Newark-Jersey City,New York County,3,2015-01-01,3413.0,2015,52904,NaN
2,61616,10002,New York,NY,New York-Newark-Jersey City,New York County,7,2015-01-01,3508.0,2015,52904,NaN
3,62037,11226,New York,NY,New York-Newark-Jersey City,Kings County,11,2015-01-01,1876.0,2015,52904,NaN
4,61807,10467,New York,NY,New York-Newark-Jersey City,Bronx County,12,2015-01-01,1442.0,2015,52904,22.97755

In [25]:
rent_data = rent_data.merge(inclvl_data,how = 'left',on = 'Date')

In [26]:
rent_data.sample(15)

,RegionID,Zipcode,City,State,Metro,County,SizeRank,Date,Rent,Year,PersonalIncome,AQIMean,Vol_moderate_income,Vol_low_income
18502,61790,10314,New York,NY,New York-Newark-Jersey City,Richmond County,111,2017-05-01,1805.0,2017,55716,NaN,4.194065e+09,8.285685e+08
25782,72236,32810,Orlando,FL,Orlando-Kissimmee-Sanford,Orange County,1122,2017-09-01,1253.0,2017,47723,NaN,4.193447e+09,8.564680e+08
14099,97837,94703,Berkeley,CA,San Francisco-Oakland-Hayward,Alameda County,1571,2016-04-01,2818.0,2016,65860,NaN,4.656035e+09,9.457059e+08
26005,72163,32714,Altamonte Springs,FL,Orlando-Kissimmee-Sanford,Seminole County,788,2017-11-01,1177.0,2017,47723,NaN,4.391051e+09,9.430037e+08
35577,61805,10465,New York,NY,New York-Newark-Jersey City,Bronx County,1171,2019-03-01,1948.0,2019,58355,18.342488,NaN,NaN
41026,97991,95123,San Jose,CA,San Jose-Sunnyvale-Santa Clara,Santa Clara County,186,2019-08-01,2816.0,2019,71668,8.668130,NaN,NaN
10614,61805,10465,New York,NY,New York-Newark-Jersey City,Bronx County,1171,2016-08-01,1694.0,2016,53694,12.477284,4.729561e+09,9.703671e+08
27449,62479,12209,Albany,NY,Albany-Schenectady-Troy,Albany County,1830,2018-05-01,1150.0,2018,56922,NaN,4.571036e+09,8.904970e+08
28070,63472,14215,Buffalo,NY,Buffalo-Cheektowaga-Niagara Falls,Erie County,951,2018-08-01,780.0,2018,56922,7.020057,NaN,NaN
42919,72488,33186,The Crossings,FL,Miami-Fort Lauderdale-West Palm Beach,Miami-Dade County,182,2019-07-01,1607.0,2019,50120,NaN,NaN,NaN
17562,62033,11222,New York,NY,New York-Newark-Jersey City,Kings County,597,2017-01-01,2728.0,2017,55716,NaN,4.900730e+09,1.108420e+09
5207,96974,92656,Aliso Viejo,CA,Los Angeles-Long Beach-Anaheim,Orange County,427,2015-04-01,1925.0,2015,64192,NaN,4.049018e+09,8.337951e+08
30597,90630,75025,Plano,TX,Dallas-Fort Worth-Arlington,Collin County,481,2018-12-01,1378.0,2018,55946,NaN,NaN,NaN
14423,96510,91770,Rosemead,CA,Los Angeles-Long Beach-Anaheim,Los Angeles County,655,2016-06-01,2964.0,2016,65860,NaN,4.751104e+09,9.758423e+08
21624,90800,75248,Dallas,TX,Dallas-Fort Worth-Arlington,Dallas County,615,2017-10-01,1302.0,2017,53815,8.314109,4.343624e+09,8.284113e+08

In [27]:
rent_data = pd.merge(rent_data, census_data, how = 'left', on = 'Zipcode')

In [28]:
rent_data.shape

(43680, 254)

In [29]:
rent_data.dtypes

RegionID                               int64
Zipcode                               object
City                                  object
State                                 object
Metro                                 object
                                      ...
in_school                            float64
in_undergrad_college                 float64
speak_only_english_at_home           float64
speak_spanish_at_home                float64
speak_spanish_at_home_low_english    float64
Length: 254, dtype: object

In [30]:
rent_data.to_csv('../../data/rent_data.csv',index = False)